Revit 2026 API

# TableSectionDataGetRowHeight Method

---

Returns a row's height in feet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetRowHeight(
	int nRow
)
```
```vb
Public Function GetRowHeight (
	nRow As Integer
) As Double
```
```cpp
public:
double GetRowHeight(
	int nRow
)
```
```fsharp
member GetRowHeight :
        nRow : int -> float
```

#### Parameters

nRow Int32

#### Return Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | The given row number nRow is invalid. |

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace